namespace Infrastructure.Models;

public static class LocationData
{
    public static readonly Dictionary<string, (double Lat, double Lon)> Coordinates = new()
    {
        // --- Norrbotten ---
        { "Arvidsjaur", (65.5920768, 19.1802828) },
        { "Arjeplog", (66.0515051, 17.8900543) },
        { "Boden", (65.825119, 21.688703) },
        { "Gällivare", (67.1339, 20.6500) },
        { "Haparanda", (65.835, 24.138) },
        { "Jokkmokk", (66.6069609, 19.8229206) },
        { "Kalix", (65.852, 23.156) },
        { "Kiruna", (67.8558, 20.2253) },
        { "Luleå", (65.584816, 22.156704) },
        { "Pajala", (67.213, 23.366) },
        { "Piteå", (65.316698, 21.480036) },
        { "Älvsbyn", (65.6763, 20.9951) },
        { "Överkalix", (66.327, 22.839) },
        { "Övertorneå", (66.390, 23.654) },

        { "Abborrträsk", (65.4491415, 19.3861593) },
        { "Glommersträsk", (65.26099, 19.6370842) },
        { "Moskosel", (65.866667, 19.416667) },
        { "Slagnäs", (65.585845, 18.1640175) },
        { "Sävast", (65.783, 21.733) },
        { "Seskarö", (65.736, 23.774) },
        { "Hortlax", (65.280, 21.430) },
        { "Gammelstad", (65.639, 22.019) },
        { "Råneå", (65.852, 22.291) },
        { "Vuollerim", (66.433, 20.600) },
        { "Malmberget", (67.175, 20.654) },
        { "Svappavaara", (67.650, 21.050) },
        { "Järvträsk", (65.2101435, 19.4830288) },

        // --- Västerbotten ---
        { "Skellefteå", (64.750, 20.950) },
        { "Umeå", (63.8258, 20.2630) },
        { "Lycksele", (64.5958098, 18.676367) },
        { "Vilhelmina", (64.625, 16.650) },
        { "Storuman", (65.096, 17.118) },
        { "Malå", (65.183, 18.733) },
        { "Norsjö", (64.912, 19.478) },
        { "Robertsfors", (64.192, 21.187) },
        { "Vindeln", (64.200, 19.717) },
        { "Vännäs", (63.917, 19.750) },
        { "Nordmaling", (63.567, 19.500) },
        { "Dorotea", (64.266, 16.416) },
        { "Sorsele", (65.5330, 17.5330) },

        { "Boliden", (64.866, 20.383) },
        { "Burträsk", (64.516, 20.650) },
        { "Bastuträsk", (64.7904348, 20.0422618) },
        { "Holmsund", (63.707, 20.365) },
        { "Hörnefors", (63.625, 19.908) },
        { "Jörn", (65.057, 20.021) },
        { "Obbola", (63.700, 20.317) },
        { "Sävar", (63.950, 20.550) },
        { "Täfteå", (63.866, 20.417) },
        { "Ånäset", (64.250, 21.083) },
        { "Åmsele", (64.517, 19.517) },
        { "Granö", (64.150, 19.450) },
        { "Kittelfjäll", (65.217, 15.500) },
        { "Ursviken", (64.700, 21.100) },
        { "Byske", (64.950, 21.200) },
        { "Kåge", (64.833, 20.950) },
        { "Skelleftehamn", (64.683, 21.233) },
        { "Bygdsiljum", (64.200, 21.200) },
        { "Ammarnäs", (65.967, 16.217) }
    };
}
